/*
 * @Author: xixi_
 * @Date: 2024-11-04 19:31:13
 * @LastEditors: xixi_
 * @LastEditTime: 2024-11-13 20:09:20
 * @FilePath: /opennessgames.github.io/xiningyouxiduan/public/js/sentence.js
 * Copyright (c) 2020-2024 by xixi_ , All Rights Reserved. 
 */
/* 句子组 */
var sentence = [
    [ /* 小破站语录 */
        "没有永恒的朋友,只有永恒的利益",
        "很多时候你得罪人,不是因为你说错了,而是因为你说对了",
        "周五的下午,永远比周末快乐;因为期待,永远比得到快乐",
        /////////////////////////////////////////////////////////////////////////////
        "不管别人的嘲笑，我要走自己想走的路。",
        "只要你确信自己正确就去做。做了有人说不好，不做还是有人说不好，不要逃避批判。",
        "要想赢，就必须不能怕输。不怕输，结果未必能赢。但是怕输，结果则必须是输。",
        "老要靠别人的鼓励才去奋斗的人不算强者;有别人的鼓励还不去奋斗的人简直就是懦夫。",
        "成功的人是跟别人学习经验，失败的人只跟自己学习经验",
        "因害怕失败而不敢放手一搏，永远不会成功。",
        "打击与挫败是成功的踏脚石，而不是绊脚石。",
        "普通人成功并非靠天赋，而是靠把寻常的天资发挥到不寻常的高度。",
        "收起羡慕别人的目光自己去努力。",
        "梦想注定是孤独的旅程，路上少不了质疑和嘲笑，但那又怎样，哪怕遍体鳞伤也要勇往直前。",
        "开始一种恐慌，停留与不可复制的回忆。",
        "就让我执迷不悟，在自己的世界勇敢地走下去。",
        "目标不是都能到达的，但它能够作为瞄准点。",
        "时间是有限的，所以不要把时间浪费在走别人的路上。",
        "除了放弃尝试以外没有失败！",
        "用脑思考，用心琢磨，用行动证实。",
        "感谢黑夜的来临，我知道今日无论有多失败，全新的明天仍然等待着我去证明自己。",
        "不要用自己的时间去见证别人的成功，愿你走过的所有弯路，最后都成为美丽彩虹！",
        "天赐我一双翅膀，就就应展翅翱翔，满天乌云又能怎样，穿越过就是阳光。",
        "把你的脸迎向阳光，那就不会有阴影。",
        "你的努力，也许有人会讥讽；你的执着，也许不会有人读懂。在别人眼里你也许是小丑，在自己心中你就是国王！",
        "不要为过去的悲伤浪费眼泪，也不要躺在曾经的掌声里沉睡。勇敢的和过去说再见，走好脚下的路，才能收获灿烂的明天。",
        "与其在风雨中逃避，不如在雷电中舞蹈，即便淋得透湿，也是领略生命的快意。",
        "这个世界其实很公平，你想要比别人强，你就必须去做别人不想做的事，你想要过更好的生活，你就必须去承受更多的困难，承受别人不能承受的压力。",
        "左右一个人成功的，不是能力，而是选择。",
        "你的选择是做或不做，但不做就永远不会有机会。",
        "一个人的知识，通过学习可以得到;一个人的成长，就必须通过磨练。若是自己没有尽力，就没有资格批评别人不用心。开口抱怨很容易，但是闭嘴努力的人更加值得尊敬。",
        "不是井里没有水，而是挖的不够深；不是成功来得慢，而是放弃速度快。得到一件东西需要智慧，放弃一样东西则需要勇气！",
        ////////////////////////////////////////////////////////////////////////////////////////
        "女生的冷暖自知什么的，在长的好看的面前都弱爆了。",
        "愚人节，只是给说谎的人，一个说真话的机会。",
        "不知道，是别人的爱情来的太容易，还是自己的八字太硬。",
        "我也有诗和远方，只不过诗很烂，远方一片黑暗。",
    ],
    [ /* 抖音顶级语录 */
        "我就是我,至于你怎么看我,既不需要,也不重要",
        "你可以讨厌一样东西,但请允许它的存在,也请允许别人喜欢它,不贬低别人的喜欢,是基本的素养",
        "当你真正被爱的时候,其实根本不用那么漂亮,那么迎合,那么优秀.踮起脚尖的喜欢是站不稳的,真正喜欢你的人是会弯腰的",
        "就算公交车上空无一人,司机也会把车开到终点站,你不要因为任何人的离开,而停止原本的生活",
        "结婚是为了幸福,离婚也是,不随便结婚更是",
        "你不必非得让那些不喜欢你的人都喜欢你,而是要让那些喜欢你的人,觉得自己真有眼光",
        "大家都是第一次做人,凭什么要让着你",
        "善解人意是什么东西,委屈我自己让你开心吗",
        "我是个好人,但这并不代表我应该做好事",
        "人都有两面,你看到我哪面,你就配哪面",
        "你讨厌我关我什么事,好像被你喜欢能升华人生似的",
        "你什么货色,我就什么脸色",
        "小时候怕鬼,因为他们狰狞恐怖;长大后怕人,因为他们衣冠楚楚",
        "对讨厌的人和事露出微笑,是我们必须学会的恶心",
        "人心中的成见是一座大山,任你怎么努力都休想搬动",
        "村里的狗叫了,其它狗也跟着叫,但是它们不知道为什么叫?",
        "我们经常扮演法官,判他人有罪,判自己无罪",
        "世界上有两样东西不能直视,一是太阳,二是人心",
        "我做好人时,坏人欺负我,我做坏人时,好人审判我",
        "丑小鸭能变成白天鹅,不是因为她有多努力,而是因为她的父母,本来就是白天鹅",
        "大雨里白鬼夜行,有人混在其中,比鬼还高兴",
        "只要你不沉迷房贷,车贷和传宗接代,五六千的工资根本花不完",
        "没理我都要争三分,得理为什么要饶人",
        "别说对不起,你要像我一样痛苦,才算道歉",
        "吃亏是福,那祝你福如东海",
        "脚踏一只船,迟早得翻船;脚踏万只船,翻都翻不完",
        "一个巴掌拍不响,我给你一个巴掌看你想不响",
        "可怜天下父母心,不当父母我省心;儿孙自有儿孙福,没有儿孙我享福",
        "别问我过得好不好,不好也帮不了,好也不是你的功劳",
        "工资都不能按时发,凭什么要求我按时到",
        "狗咬了我,我不但要咬回去,还要咬两口",
        "年轻人的机会很多,但年轻人也很多",
        "这些三观不正吗？非要遵循所以大多数人认定的事吗？只要不犯宪法里面的是就行了",
        "说的最好听的一句就是现在上boss上找工作，全是各种要经验的，这么多这书读的有什么意义，真的就像网络上面所说的，你本来就打工的命，只不过多读了两年书，这句话我是真的反驳，都反驳不了，想想我这个也是啊"
    ],
    [ /* 弱智吧顶级语录 */
        "吃什么补什么,所以吃苦,成不了人上人,只有吃人才行。",
        "刚出生的婴儿会哭,那是对生的喜悦,还是对世界的恐惧。",
        "我们向禁欲的寺庙求姻缘,向不出门的方丈问人生。",
        "向街边瞎了眼的道士看前程,向最爱自己的人证明,他没有那么爱你。",
        "很多人看不到未来,其实是看到了未来。",
        "我不害怕死亡,因为那边也有我的家人。",
        "工人罢了工,所以成了人,人顶起了工,所以有了天。",
        "山是地质年代,及其缓慢的浪,于暴雨中行走,伞是倒挂在天空的船。",
        "我是这世界的主角,我不在,那世界便不在。",
        "咖啡因来自咖啡果,而咖啡因是果,咖啡果是因。",
        "人只有醒来后,才知道自己睡了一觉,所以放自己去睡吧。",
        "我租下这个世界,只到我死去的那天。",
        "世界是一个巨大的棺材,我每天躺下练习葬礼,直到一天不再掀起被子。",
    ]
]

/* 生成一个 0~n 之间的随机整数 */
function getRandomNumber(Max) {
    return Math.floor(Math.random() * Max);
}

/* 生成不重复的两个随机数 */
function generateUniqueRandomNumbers(Max) {
    var num1, num2;

    num1 = getRandomNumber(Max);
    num2 = getRandomNumber(Max);

    /* 直至两个数不一致 */
    while (num2 === num1) {
        num2 = getRandomNumber(Max);
    }

    return [num1, num2]; /* 返回两个随机数 */
}


/* 随机获取两个句子 */
function GetRandomSentence() {
    var ThisIndex1 = getRandomNumber(sentence.length);/* 随机获取一个组 */
    var ThisIndex2 = getRandomNumber(sentence.length);/* 随机获取一个组 */
    if (ThisIndex1 === ThisIndex2) {
        return [ThisIndex1, ThisIndex1, generateUniqueRandomNumbers(sentence[ThisIndex1].length)]; /* 返回索引组,句子索引 */
    } else {
        var Sentence1Index = sentence[ThisIndex1].length;
        var Sentence2Index = sentence[ThisIndex2].length;
        return [ThisIndex1, ThisIndex2, [getRandomNumber(Sentence1Index), getRandomNumber(Sentence2Index)]];
    }
}
/* 
    结构
    [n1,n2,[n3,n4]]
 */
var AllIndex = GetRandomSentence(); /* 获取索引 */
/* 在主页显示语录 */
var dateElement = document.querySelector('.sentence1').textContent = sentence[AllIndex[0]][AllIndex[2][0]];
var dateElement = document.querySelector('.sentence2').textContent = sentence[AllIndex[1]][AllIndex[2][1]];   
